Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d (Conv1D)              (None, 20, 32)            256       
_________________________________________________________________
dropout (Dropout)            (None, 20, 32)            0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 10, 16)            3600      
_________________________________________________________________
conv1d_transpose (Conv1DTran (None, 20, 16)            1808      
_________________________________________________________________
dropout_1 (Dropout)          (None, 20, 16)            0         
_________________________________________________________________
conv1d_transpose_1 (Conv1DTr (None, 40, 32)            3616      
_________________________________________________________________
conv1d_transpose_2 (Conv1DTr (None, 40, 1)             129       
=================================================================
Total params: 9,409
Trainable params: 9,409
Non-trainable params: 0
_________________________________________________________________
